### 2.2 데이터 프레임 (DataFrame)

In [2]:
import numpy as np
import pandas as pd

- 생성방법1
    - 2차원 데이터, 컬럼, 인덱스

In [3]:
df1 = pd.DataFrame(
    np.random.randint(40, 101, 12).reshape(4, 3),       # 2차원 데이터
    columns=list('XYZ'),    # 컬럼명, list('XYZ') == ['X', 'Y', 'Z']
    index=list('abcd')      # 인덱스
)
df1

    X    Y   Z
a  84   59  70
b  62   92  72
c  87   78  55
d  42  100  69

- 생성방법 2
    - 딕셔너리의 리스트

In [4]:
data = [
    {'X': 67, 'Y': 50, 'Z': 45},
    {'X': 72, 'Y': 88, 'Z': 79},
    {'X': 71, 'Y': 78, 'Z': 57},
    {'X': 82, 'Y': 75, 'Z': 98}
]
df2 = pd.DataFrame(data, index=list('abcd'))
df2

    X   Y   Z
a  67  50  45
b  72  88  79
c  71  78  57
d  82  75  98

- 생성방법 3
    - 데이터가 value, 컬럼명이 key가 되는 딕셔너리

In [5]:
data = {
    'X': [67, 72, 71, 82],
    'Y': [50, 88, 78, 75],
    'Z': [45, 79, 57, 98]
}
df3 = pd.DataFrame(data, index=list('abcd'))
df3

    X   Y   Z
a  67  50  45
b  72  88  79
c  71  78  57
d  82  75  98

- 여러가지 타입이 혼합된 형태의 데이터로 생성

In [6]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [7]:
df.index.name = '도시'
df.columns.name = '항목'
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [8]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [9]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object', name='항목')

In [10]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object', name='도시')

- 연습 문제 4.1.2

In [11]:
#다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.
#(1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.
#(2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

data = {
    "name": ['박명수', '유재석', '노홍철', '길', '정준하'],
    "math": [100, 20, 10, 70, 80],
    "english": [60, 70, 80, 78, 100],
    "korean": [50, 60, 90, 77, 65],
    "art": [55, 77, 85, 45, 20],
    "science": [70.5, 65.6, 88.4, 88.2, 100],
}
columns = ["name", "math", "english", "korean", "art", "science"]
index = ["1", "2", "3", "4", "5" ]
score = pd.DataFrame(data, index=index, columns=columns)
score

  name  math  english  korean  art  science
1  박명수   100       60      50   55     70.5
2  유재석    20       70      60   77     65.6
3  노홍철    10       80      90   85     88.4
4    길    70       78      77   45     88.2
5  정준하    80      100      65   20    100.0

In [12]:
# 선생님 답
data = []
for i in range(5):
    d = {
        '문자열': chr(np.random.randint(65,91)) + chr(np.random.randint(65,91)),    #65,91 :대문자 A ~ Z 까지
        '정수1': np.random.randint(1,7),
        '정수2': np.random.randint(40, 101),
        '정수3': np.random.randint(1, 100) * 1000,
        '실수': round(np.random.random(), 4)
    }
    data.append(d)
df4 = pd.DataFrame(data, index=list('vwxyz'))
df4

  문자열  정수1  정수2    정수3      실수
v  XS    5   82  53000  0.3807
w  YN    3   89  76000  0.2277
x  FF    4   59   6000  0.7608
y  QC    6   94  22000  0.0445
z  OR    6   68  67000  0.8851

- 전치 (Transpose)

In [13]:
df4.T

          v       w       x       y       z
문자열      XS      YN      FF      QC      OR
정수1       5       3       4       6       6
정수2      82      89      59      94      68
정수3   53000   76000    6000   22000   67000
실수   0.3807  0.2277  0.7608  0.0445  0.8851

- 열 데이터의 갱신, 추가

In [14]:
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [15]:
df['2010-2015 증가율'] = df['2010-2015 증가율'] * 100
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [16]:
#열 이름이 있으면 갱신, 없으면 추가
df['Eng name'] = ['Seoul', 'Busan', 'Incheon', 'Daegu']
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율 Eng name
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83    Seoul
부산  경상권  3448737  3393191  3512547  3655437           1.63    Busan
인천  수도권  2890451  2632035  2517680  2466338           9.82  Incheon
대구  경상권  2466052  2431774  2456016  2473990           1.41    Daegu

- 열 삭제

In [17]:
del df['2000']

In [18]:
df.drop(columns=['2005','2010'], inplace=True)  #열을 지울때는 columns= 을 넣어줘야함
df

항목   지역     2015  2010-2015 증가율 Eng name
도시
서울  수도권  9904312           2.83    Seoul
부산  경상권  3448737           1.63    Busan
인천  수도권  2890451           9.82  Incheon
대구  경상권  2466052           1.41    Daegu

In [19]:
# 행을 지울 때 (인덱스명을 안넣어도 됨)
df.drop(['대구'], inplace=True) 
df

항목   지역     2015  2010-2015 증가율 Eng name
도시
서울  수도권  9904312           2.83    Seoul
부산  경상권  3448737           1.63    Busan
인천  수도권  2890451           9.82  Incheon

- 열 인덱싱

In [20]:
# 열 이름을 하나만 선택하면 시리즈 반환
df['지역']

도시
서울    수도권
부산    경상권
인천    수도권
Name: 지역, dtype: object

In [21]:
# 열 이름이 리스트로 감싸져 있으면 데이터 프레임 반환 
df[['지역','Eng name']]

항목   지역 Eng name
도시
서울  수도권    Seoul
부산  경상권    Busan
인천  수도권  Incheon

- 개별 인덱싱

In [22]:
# 데이터프레임[열 이름][행 인덱스]
df['지역']['서울'], df['지역'].서울, df.지역['서울'], df.지역.서울

('수도권', '수도권', '수도권', '수도권')

In [23]:
# 컬럼명이 숫자로 시작하거나 공백이 있는 경우에는 . 컬럼명을 사용할 수 없음
df.2015['서울']

SyntaxError: invalid syntax (2605018616.py, line 2)

- 연습 문제 4.1.3

In [ ]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [ ]:
#(1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [ ]:
#(2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [ ]:
#(3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df['Score_avg'] = ((df['국어'] + df['영어'] + df['수학']) / 3)
df

    국어  영어  수학  Score_avg
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [ ]:
# 선생님 답
df['평균'] = (df.sum(axis=1) / len(df.columns)).round(1)
df

In [ ]:
#(4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
import warnings
warnings.filterwarnings('ignore')   # warning 안보이게!

df['영어']['방자'] = 80
df['Score_avg'] = ((df['국어'] + df['영어'] + df['수학']) / 3)
df

C:\Users\human\AppData\Local\Temp\ipykernel_3668\4116921807.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['영어']['방자'] = 80

    국어  영어  수학  Score_avg
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

In [ ]:
#(5) 춘향의 점수를 데이터프레임으로 나타낸다.
df[0:1]     #0 생략 가능

    국어  영어  수학  Score_avg
춘향  80  90  90  86.666667

In [ ]:
# 선생님 답 1
df.loc[['춘향']]

In [ ]:
# 선생님 답 2
df.T[['춘향']]

In [ ]:
# 선생님 답 3
df['춘향' : '춘향']

In [ ]:
#(6) 향단의 점수를 시리즈로 나타낸다.
df.loc['향단']

국어           70.0
영어           60.0
수학           80.0
Score_avg    70.0
Name: 향단, dtype: float64

In [ ]:
# 선생님 답
df.T['향단']